app/views/items/_form.html.erb

<%= f.label :category %><br>
<%= f.collection_select :category_id,Category.all,:id,:name %>
---
SELECT `categories`.* FROM `categories`