app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
  def index
    @items = Item.all

INSERT INTO `items` (`title`, `category_id`, `created_at`, `updated_at`) VALUES ('foto', 2, '2016-05-12 05:08:07.698316', '2016-05-12 05:08:07.698316')
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])